Repository: R1ma0/StraightenedSpiralArmDetector
Catalog: i18n/languages/*/StraightSpiralArmsDetector.po
Languages: ru

source: files.
ru: файлов.

source: folder does not contain
ru: не содержит

source: Adaptive Zhang-Suen
ru: Адаптивный Зонга-Суня

source: Application language
ru: Язык приложения

source: Apply
ru: Применить

source: Binary threshold:
ru: Пороговая бинаризациия:

source: Current height:
ru: Текущая высота:

source: Current value:
ru: Текущее значение:

source: Current width:
ru: Текущая ширина:

source: Error
ru: Ошибка

source: File
ru: Файл

source: File search error
ru: Ошибка поиска файла

source: Gauss block size:
ru: Размер блока Гаусса:

source: Gaussian block size value (odd):
ru: Значение размера блока Гаусса (нечетное):

source: Gaussian constant:
ru: Гауссова постоянная:

source: Image compress percentage:
ru: Процент сжатия изображения:

source: Image compression percentage:
ru: Процент сжатия изображения:

source: Image opening error!
ru: Ошибка открытия изображения!

source: Image saving
ru: Сохранение изображения

source: Image saving error!
ru: Ошибка сохранения изображения!

source: Image selection
ru: Выбор изображения

source: Increase the size of the image in the preview window
ru: Увеличить размер изображения в окне предпросмотра

source: Max
ru: Максимум

source: Min
ru: Минимум

source: Multi-image processing
ru: Обработка нескольких изображений

source: Multiple processing: Adaptive Zhang-Suen method
ru: Множественная обработка: Адаптивный метод Зонга-Суня

source: Open the image rotation and stretching window
ru: Открыть окно поворота и растяжения изображения

source: Parameter
ru: Параметр

source: Preparation...
ru: Подготовка...

source: Process
ru: Обработать

source: Processing
ru: Обработка

source: Ready/Total
ru: Готово/Всего

source: Reduce the image size in the preview window
ru: Уменьшить размер изображения в окне предпросмотра

source: Rotation
ru: Поворот

source: Rotation and stretching
ru: Поворот и растяжение

source: Rotation and stretching Alt-R
ru: Поворот и растяжение Alt-R

source: Save image Ctrl-S
ru: Сохранить изображение Ctrl-S

source: Save the processed image
ru: Сохранить обработанное изображение

source: Save the processed images to...
ru: Папка сохранения изображений...

source: Set height:
ru: Установить высоту:

source: Set value:
ru: Установить значение:

source: Set width:
ru: Установить ширину:

source: Skeletonisation algorithms
ru: Алгоритмы скелетизации

source: Spiral galaxy handler
ru: Обработчик спиральных галактик

source: Step
ru: Шаг

source: Stop
ru: Прервать

source: Stretch
ru: Растяжение

source: Take the source images from...
ru: Папка загрузки изображений...

source: The selected language is unsupported. The default language is set.
ru: Выбранный язык не поддерживается. Установлен язык по умолчанию.

source: Threshold binarisation value:
ru: Значение пороговой бинаризации:

source: Upload an image for processing
ru: Загрузка изображения для обработки

source: Upload image Ctrl-O
ru: Загрузить изображение Ctrl-O

source: Use Zhang-Suen`s adaptive skeletonisation method
ru: Использовать адаптивный метод скелетизации Зонга-Суня

source: Use Zhang-Suen`s adaptive skeletonisation method for multiple images
ru: Использовать адаптивный метод скелетизации Зонга-Суня

source: View
ru: Вид

source: Wrong language has been selected! The default language is set.
ru: Выбран неверный язык! Установлен язык по умолчанию.

source: Zhang-Suen method settings
ru: Настройки метода Зонга-Суня

source: Zoom in Ctrl-+
ru: Увеличить Ctrl-+

source: Zoom out Ctrl--
ru: Уменьшить Ctrl--

source: degrees
ru: градусов

source: pixels
ru: пикселей
